lvdlvd/stm32l432_hello/boot.c
#include "arm_cm4.h"
#include "stm32l4xx.h"

#include "clock.h"

extern void main(void);								// in main.c
extern void (*const vector_table[])(void);			// in vector.c
extern uint32_t _sitext, _eitext, _loadtext;	// provided by linker script
extern uint32_t _sidata, _sdata, _edata, _sbss, _ebss;	// provided by linker script

// how many clock cycles to wait before deciding not to use HSE (CK_IN)
enum { HSE_RDY_TIMEOUT = 40000 };

// This is the first thing that runs after the CPU comes out of reset.
// It loads the data segment, clears the Blank Stuff Segment,
// sets up the interrupt vector table to load from flash,
// initializes fault handling and FPU access,
// sets up the system clock to run at 64/80MHz, starts the system
// timer and calls main().
void Reset_Handler(void) {

  // uint32_t *src = &_sitext;
  // uint32_t *dst = &_loadtext;
  // while (src < &_eitext) {
  //   *dst++ = *src++;
  // }

	// Copy data segment to RAM (see stm32XXXX.ld)
  uint32_t *src = &_sidata;
  uint32_t *dst = &_sdata;
  while (dst < &_edata) {
    *dst++ = *src++;
  }

	// clear BSS segment (see stm32XXXX.ld)
	for (uint32_t *p = &_sbss; p < &_ebss; p++) {
		*p = 0;
	}

	// Vector Table Relocation in Internal FLASH
	// PM0214 sec 4.4.4
	SCB.VTOR = (uintptr_t)&vector_table;  // provided in vectors.c

//  syscfg_memrmp_set_mem_mode(3);

	// PM0214 sec 4.4.7
	SCB.CCR |= SCB_CCR_DIV_0_TRP;  // division by zero causes trap
	// enable usage/bus/mem fault separate handlers (in fault.c)
	// PM0214 sec 4.4.9
	SCB.SHCSR |= SCB_SHCSR_USGFAULTENA | SCB_SHCSR_BUSFAULTENA | SCB_SHCSR_MEMFAULTENA;

	// section 4.6.1 CP10/CP11 (FPU) Full Access
	fpu_cpacr_cpacr_set_cp(0xf);

	// Disable all interrupts and clear pending bits
	RCC.CIER = 0;
	RCC.CICR = RCC.CIFR;

	// See RM0394 Section 6 for details on configuration of the clock tree.

	// feeding all peripherals to run at 64Mhz
	rcc_cfgr_set_hpre(0);	// AHB HCLK = SYSCLK  =  64MHz
	rcc_cfgr_set_ppre1(0);	// APB1 PCLK = AHB HCLK
	rcc_cfgr_set_ppre2(0);	// APB2 PCLK = AHB HCLK

	// set system clock to PLL 64 MHz, fed by MSI at 4MHz, or CK_IN(pa0) 8MHz

#if 0
	// wait for HSE ready for a few ms, if not, fall back to MSI
	// tested closing SB17 on the STM32L432k nucleo board

	// enable HSE on CK_IN (PA0) and wait for ready
	RCC.CR |= RCC_CR_HSEBYP | RCC_CR_HSEON;
	for (uint32_t t = 0; t < HSE_RDY_TIMEOUT; t++)
		if (RCC.CR & RCC_CR_HSERDY)
			break;

	if (RCC.CR & RCC_CR_HSERDY) {
		// if we got HSE ready, use it
		rcc_pllcfgr_set_pllsrc(3);  // select 3:HSE (CK_IN via HSEBYPASS, assume 8MHz)
		rcc_pllcfgr_set_pllm(1);	  // 0..15 : vco_in = HSE / (1+m)  4..16MHz        8/2 = 4MHz
	} else {
		// otherwise fall back to MSI
		RCC.CR &= ~(RCC_CR_HSEBYP | RCC_CR_HSEON);
		rcc_pllcfgr_set_pllsrc(1);  // select 1:MSI source (4MHz)
		rcc_pllcfgr_set_pllm(0);	  // 0..15 : vco_in = MSI / (1+m)  4..16MHz        4/1 = 4MHz
	}
#else

	RCC.CR |= RCC_CR_HSION;
	// Wait till HSI is ready
	while ((RCC.CR & RCC_CR_HSIRDY) == 0) {
		__NOP();
	}

	rcc_pllcfgr_set_pllsrc(2);	// select 1:HSI16 source (16MHz)
	rcc_pllcfgr_set_pllm(3);	// 0..15 : vco_in = HSI / (1+m)  4..16MHz        16/4 = 4MHz

#endif

	rcc_pllcfgr_set_plln(32);			// 8...86 : vco_out = vco_in * n = 64...344MHz    4 * 32 = 128MHz
	rcc_pllcfgr_set_pllr(0);			// 0,1,2,3 -> p=2,4,6,8  : sysclk = vco_out / p <= 170MHz  4 * 32 / 2 = 64MHz
	RCC.PLLCFGR |= RCC_PLLCFGR_PLLREN;	// emable R output (system clock)
	RCC.CR |= RCC_CR_PLLON;				// switch on the PLL

	// prepare the flash, RM0394 section 3.3.3
	FLASH.ACR = FLASH_ACR_PRFTEN | FLASH_ACR_ICEN | FLASH_ACR_DCEN;
	flash_acr_set_latency(3);  // 3 wait states (4 cycles) cf 3.3.3 p79 table 9
	while (flash_acr_get_latency() != 3) {
		__NOP();
	}

	// Wait till PLL is ready
	while ((RCC.CR & RCC_CR_PLLRDY) == 0) {
		__NOP();
	}

	// Select PLL as system clock source and wait until it takes effect
	rcc_cfgr_set_sw(3);
	while (rcc_cfgr_get_sws() != 3) {
		__NOP();
	}

	// Prepare the Cortex system timer
	stk_load_set_reload(STK_LOAD_RELOAD);  // maximum value
	stk_val_set_current(STK_LOAD_RELOAD);
	STK.CTRL |= STK_CTRL_CLKSOURCE | STK_CTRL_TICKINT | STK_CTRL_ENABLE;

	main();

	for (;;) {
		__NOP();  // hang
	}
}

volatile uint64_t clockticks = STK_LOAD_RELOAD + 1;

// when this irq has a higher priority than all userspace, we may consider
// update to be atomic clockticks holds the counts at the _end_ of the next
// systick, so cyclecount can just subtract current VAL (which counts down)
void SysTick_Handler(void) { clockticks += STK_LOAD_RELOAD + 1; }

extern inline void delay(uint32_t usec);